{
  "posts": [
    {
      "id": 2,
      "title": "Barcelona Keen on PSG Star With Paul Pogba Also Shortlisted as Catalans Seek New Midfield General",
      "author": "Reece Dodgen",
      "timeDate": "",
      "content": "​Barcelona have reportedly stepped up the chase for Paris Saint-Germain midfielder Adrien Rabiot, and are also considering a sensational move for ​Manchester United midfielder Paul Pogba, as they continue their hunt for a new midfield general.According to Mundio Deportivo, 23-year-old Rabiot has repeatedly turned down his current club's attempts to tie him down with a new contract, and is determined to leave the Parc des Princes this summer. In particular, Rabiot is believed to heartbroken at missing out on a place in Frances victorious World Cup winning squad, and is eager to raise his profile with a move to Barça.Rabiot has just one year left on his contract with the Ligue 1 giants, who are likely to cash in on the talented midfielder so as to avoid running the risk of losing him on a free transfer upon the expiration of his deal. It appears to be a matter of when, rather than if the move goes through, as Barcelona look to complete their first major piece of summer transfer business. The Spanish outlet have also reported that Barcelona are keeping tabs on Manchester United midfielder Paul Pogba, but are insistent that the likes of Ajax wonderkid Frenkie de Jong, Chelsea's Willian and the aforementioned Rabiot are manager Ernesto Valverde's primary targets. Pogba endured a season of mixed fortunes at United last season, with his feast or the famine performances drawing criticism from a number of football pundits, as well as his formidable manager, José Mourinho. However, the 25-year-old starred at the World Cup with France, and has proved that he is more than capable of producing the goods at the highest level.​It certainly looks set to be a summer of upheaval at Barça, and reports have also suggested that the club could look to offer ​Chelsea their prized youngster Ousmane Dembélé in exchange for Blues talisman Eden Hazard. The Belgian ace is also being coveted by ​Real Madrid, who could capture both the tenacious forward and Chelsea stopper Thibaut Courtois in one swoop.",
      "img": "https://images2.minutemediacdn.com/image/upload/c_scale,w_912,h_516,c_fill,g_auto/shape/cover/sport/fbl-fra-cup-herbiers-psg-5b509feff7b09d7d17000014.jpg"
    },
    {
      "id": 3,
      "title": "Man Utd's Luke Shaw Feels 'Really Good' & Is Determined to Prove Himself in Pre-Season",
      "author": "Jarod Britz",
      "timeDate": "",
      "content": "​Manchester United left-back Luke Shaw is determined to make the most of his opportunity this pre-season as he fights to earn a regular place and save his Old Trafford career. Shaw has recently entered the final 12 months of his contract and his United future has been showered in speculation that he will be moved on. But the club have shelved plans to sign a new left-back and the 23-year-old is working incredibly hard to prove himself.And with United still without a number of first team players because of their participation at the World Cup, manager Jose Mourinho has already hinted that Shaw, Eric Bailly and Andreas Pereira will all have chances to stake their claim in upcoming friendlies.'There aren't just opportunities for me, there are opportunities for all the players,' Shaw is quoted as saying by ManUtd.com as he appeared at a press conference this week.'I look at it like that and I'm training hard and when the games come around - the next five are all about fitness, I want to try to prove to the manager that I can be in his team.'When everyone comes back and everyone is fit and ready, I still want to be one of the first names on the team-sheet. It's time for me to show him over the next few weeks in particular what I can do and why I deserve to be in his team. Before pre-season officially started, Shaw was ​training in Dubai to improve his fitness and replicate what he achieved in the summer of 2015 when he feels he was at his very best.Shaw was arguably United's best player in the opening weeks of the 2015/16 season as a result of the extra work he had put in. In his own words he felt 'really strong', but then a horrific broken leg suffered in the Champions League stopped him in his tracks. As for his relationship with Mourinho? 'It's annoying for me to say I need to prove myself but I know what I can do and that's why I'm still here. I'm sure that's what the manager thinks because I don't think I would still be involved right now if he didn't believe in me,' Shaw explained.'I've had a good chat with him and I'm looking forward to the season and getting back to my best. 'A year ago today I was injured and doing rehab but I look at this year as being able to do a full pre-season and, right now, things are going really well and I feel really strong and good. I need to keep that up, not just now, but during the season and prove to people why I'm here.",
      "img": "https://images2.minutemediacdn.com/image/upload/c_scale,w_912,h_516,c_fill,g_auto/shape/cover/sport/swansea-city-v-manchester-united-carabao-cup-fourth-round-5b508d76347a02d0d7000001.jpg"
    },
    {
      "id": 4,
      "title": "Cristiano Ronaldo's Mum Rubbishes Claims She Preferred Her Son to Return to Manchester United",
      "author": "Aqueelah Taljaard",
      "timeDate": "",
      "content": "  ​Cristiano Ronaldo’s mum has broken her silence, rubbishing claims she wanted her son to return to Manchester United this summer. Jose Mourinho’s side had been heavily linked with a reunion for the Portuguese star but a move did not materialise, with Ronaldo instead stunning the world by agreeing a deal to join Serie A champions Juventus for £88m.A deal for one of the best players of all time was expected to be much more widely publicised and drawn out, but a deal between Real Madrid and Juventus seemed to crop up almost overnight between the two sides.Following comments about his future in the immediate aftermath of the Champions League final, many expected Ronaldo to join either Paris Saint-Germain or return to Manchester United if he were to leave the Santiago Bernabeu. Some reports even quotes his mother as saying she would prefer a Premier League return for her son. Since the completion of Ronaldo's switch to Juventus, reports have emerged claiming that Dolores Aveiro was unhappy with her son's decision to move to Turin. However, speaking at the star's unveiling, she stated that nothing could be further from the truth. As quoted by the Manchester Evening News: 'It's a lie that I wanted him to return to Manchester United - It's not true.'I'm very happy with his choice. It's a very happy day for all of us. My son will make Juve even bigger. This is a new adventure and a new life. He enjoyed it at Real Madrid but he needed other challenges.Ronaldo scored 450 goals in 438 games for Real Madrid, winning 15 major honours and picking up four Ballon d'Or awards.Now 33, the forward has no plans of slowing down and has already vowed to win the Champions League with Juve.\r\n            </span>",
      "img": "https://images2.minutemediacdn.com/image/upload/c_scale,w_912,h_516,c_fill,g_auto/shape/cover/sport/fbl-wc-2018-match49-uru-por-5b5056097134f66ee4000002.jpg"
    },
    {
      "id": 5,
      "title": "Jose Mourinho Voices Displeasure Over Alexis Sanchez Absence From Man Utd Tour Squad",
      "author": "Speciose Kamanzi",
      "timeDate": "",
      "content": "​Manchester United manager Jose Mourinho has voiced his displeasure over the situation that forced the club to leave star forward Alexis Sanchez behind for the club's pre-season tour of the United States after the Chilean was denied a visa to enter the country.A tax fraud conviction in Spain earlier this year relating to income earned while he was with Barcelona is thought to be the reason that Sanchez has so far been unable to obtain the necessary paperwork to get into America for United's pre-season schedule.With the squad based stateside for the rest of the month, Mourinho has confirmed that club officials are working on a solution that would allow Sanchez to join up with his teammates. For now, though, the boss has described the situation as 'really bad'.'It's really bad and he's really sad', Mourinho is quoted as saying by ManUtd.com. It's not good for him and not good for me, or for the team. There is no-one to blame. I know the club is making the effort but the US authorities have their processes.'Hopefully, he can at least join us later because it is important to work with Juan Mata, Alexis and Anthony Martial, who we think are the players we have for the start of the season.'United go into the new season with minimal attacking options as Romelu Lukaku, Marcus Rashford and Jesse Lingard are all on holiday after lengthy World Cup campaigns.On a positive note, Mourinho has confirmed that the squad will be boosted by the arrivals of David de Gea, Nemanja Matic and new signing Fred.'Next week will come De Gea, Matic and Fred, which is good. Especially Fred, a new player to be with us,' the Portuguese explained. Phil Jones, Ashley Young and Marouane Fellaini are the other United players who were at the World Cup until the final weekend and who will be missing for several weeks more. 'Maybe it's good for Luke Shaw, Eric Bailly and Andreas Pereira, who is just back from a loan,' Mourinho pondered as he considered his selection options.",
      "img": "https://images2.minutemediacdn.com/image/upload/c_scale,w_912,h_516,c_fill,g_auto/shape/cover/sport/chelsea-v-manchester-united-the-emirates-fa-cup-final-5b504c757134f653d5000002.jpg"
    },
    {
      "id": 6,
      "title": "Mourinho Reveals What He Said to Paul Pogba at World Cup & Reveals His Challenge for the New Season",
      "author": "Jarod Britz",
      "timeDate": "",
      "content": "                                ​Manchester United manager Jose Mourinho has set French World Cup winner Paul Pogba the task of replicating his form in Russia on the pitch at Old Trafford next season - and asked him to understand what made him play so well in the tournament.Mourinho was in typical mood as he spoke at a press conference from the club's pre-season tour of the United States, revealing that he was concerned ​Alexis Sanchez could miss the entire trip after being refused entry into the country, and that ​a number of his players could miss the opening game of the season.Pogba may be one of those players, but speaking to the ​Daily Mirror, Mourinho went on to reveal how his relationship developed with Pogba over the summer and what he expected from him next. He said: “After the World Cup I sent Paul a different message to the other guys. Now he is world champion with his country, I think you forget all the painful moments in your career. To win the World Cup can only be a positive. It is difficult to say winning the World Cup is not good for a player’s career, I can only imagine it will only be positive“I hope he understands why he was very good – that’s the point, for him to understand why he was so good especially in the second part of the competition. “I did with Paul what I did with all my players - I sent a nice message before the World Cup and during it I did not disturb anyone. They needed to focus on the job for their national team.” Pogba and Mourinho famously fell out last season because of Pogba's tactical discipline on the pitch - or lack thereof - which was a disappointment considering how well he'd started the season before sustaining an injury against Basel in the Champions League.He has been linked with a move away - Juventus, Barcelona and Real Madrid have all been talked up as potential destinations - but Pogba is expected to continue at United next season as they hunt for their first league title since 2013.\r\n            \r\n            ",
      "img": "https://images2.minutemediacdn.com/image/upload/c_scale,w_912,h_516,c_fill,g_auto/shape/cover/sport/sevilla-v-manchester-united-uefa-champions-league-5b5040453467ac71d3000020.jpg"
    },
    {
      "id": 7,
      "title": "Coming Home! Ajax Post Amazing Video Welcoming Daley Blind as €16m Man Utd Departure Is Confirmed",
      "author": "Rustin Cassiem",
      "timeDate": "",
      "content": "                                Ajax have officially completed the signing of Manchester United defender/midfielder Daley Blind for a fee of €16m (£14.2m) that could rise to €20.5m (£18.2m) if various add-ons are triggered. United had earlier confirmed that terms of the transfer had been agreed with the Dutch giants.Blind, who left Ajax to move to Old Trafford in 2014 after impressing at that summer's World Cup, has now signed a four-year contract with his boyhood club that will run until 2022. The 28-year-old played 141 games in all competitions during his four seasons with United, including 56 times during 2015/16 alone when Louis van Gaal used him as a centre-back. Blind won FA Cup, EFL Cup and Europa League honours with United.The player, whose father Danny captained Ajax to Champions League glory in 1995, first joined the youth ranks of the Amsterdam club at the age of eight. He made his first team debut in 2008 while still a teenager and won four Eredivisie titles during his first spell. Blind was named Dutch Footballer of the Year in 2014 and Ajax, who are delighted to be welcoming the player 'home', have not actually won a trophy since he left.A United statement detailing Blind's achievements at Old Trafford finished with: It goes without question that everyone at the club wishes him well for the future.\r\n            \r\n            ",
      "img": "https://images2.minutemediacdn.com/image/upload/c_scale,w_912,h_516,c_fill,g_auto/shape/cover/sport/slovakia-v-holland-international-friendly-5b4dc648347a028e8600002a.jpg"
    },
    {
      "title": "Soccer",
      "author": "Jarod",
      "timeDate": "01/02/03",
      "content": "<p>kjxcbvhjzf vh,jzdfhvbzdvbjhdf vjherbvjdsc seyfubsurincviows coisodncvkusegicv sddhush</p>",
      "id": 8
    },
    {
      "title": "Soccer",
      "author": "Jarod",
      "timeDate": "01/02/03",
      "content": "<p>kjxcbvhjzf vh,jzdfhvbzdvbjhdf vjherbvjdsc seyfubsurincviows coisodncvkusegicv sddhush</p>",
      "id": 9
    }
  ],
  "users": [
    {
      "id": 1,
      "username": "jarod",
      "password": "1234",
      "email": "jarodbritz@gmail.com"
    },
    {
      "username": "Jarod Britz",
      "password": "06041999",
      "email": "jarodbritz@gmail.com",
      "id": 2
    },
    {
      "username": "Ridhaa",
      "password": "12345",
      "email": "jarodbritz@gmail.com",
      "id": 4
    },
    {
      "username": "ling",
      "password": "ling12",
      "email": "a@gmail.com",
      "id": 5
    },
    {
      "username": "ridhaa",
      "password": "123456",
      "email": "jarodbritz@gmail.ciom",
      "id": 6
    },
    {
      "username": "jamie",
      "password": "181825",
      "email": "jamiecupido@gmaiil.com",
      "id": 7
    },
    {
      "username": "speciose",
      "password": "123456",
      "email": "jarodbritz@gmail.com",
      "id": 8
    },
    {
      "username": "NelisaBani",
      "password": "Nelisabani96",
      "email": "nelisalisabani@gmail.com",
      "id": 9
    }
  ]
}